{
  "title": "我考杭高，真的假的？会上岸吗？",
  "content": "> 本文为2025年国科大杭州高等研究院（杭高院）智能学院一战考研经历分享，力求覆盖备考过程中的重要细节，并整理出具有实践意义的方法论，望对屏幕前的各位考生有所帮助。\n\n省流：真的；会。\n![[acceptance.png]]\n# 1 背景\n安大计科，均绩3.77/5，应届（一战）报考杭高院智能体系结构（085404）方向，初试位次3、复试位次3、综合位次2。\n\n是不是感觉我考得有点高，不太适合你？别急，**我自己也没想到**能拿到这个分，先往下看看也无妨。\n\n![[340.jpg|当时定下的目标]]\n\n![[megakite-22408-marks.png|最终成绩，结果数学冲百二、计科保下限了，有点崩溃]]\n\n## 1.1 为何考研？\n四月份骑车摔骨折住院了，手术过后沉淀了一阵子，想想还是考个研吧。\n## 1.2 为何选择杭高体系？\n因为我完全没有概率直觉，无法理解古典概型部分的基础知识，妄议牵涉到微积分的部分，故我无法学习概率论，只能考虑数学二；此外，我理解但无法接受深度学习的现象学（黑箱）式的体系，且我**非常讨厌**Python，故无法进行深度学习相关工作；再者，我的算法能力几乎为零，从而对机试完全没有信心，故不考虑科软等含机试的学校。\n\n然后就只剩杭高和软件所可以考了。我那时候寻思今年软件所应该是大年——最后的结果大伙都看见了，大抄特抄——而且我哪知道自己真能考380啊，那就选杭高体系呗。\n# 2 初试\n![[megakite-22408-table.png|时间线（均为修正后的实际执行时间）]]\n\n整个初试部分的核心内容都在上图当中。可以看到，我的备考过程以8月19日为界限划成两大阶段：前100天玩，后124天学；这点从日均有效时长和进度上也能看得出来。如此计算，我认为自己真正的备考总时长应当是**5至6个月**。\n\n![[11-hours.jpg|日均有效时长的巅峰：白天880，晚上408]]\n\n![[13-days.png|最后13天的安排，完全按照考试节奏进行]]\n\n我的平均睡眠时长为7小时22分钟，且下限不少于6小时15分钟，这一点从始至终都**严格保证**——当然，考试那两天除外。我不定闹钟，这124天都是自然醒，因为我**非常讨厌**被闹钟叫醒的感觉，我会觉得我的一天都被毁了，完全无法学习。\n## 2.1 数学（二）\n### 2.1.1 背景\n我对数学是挺感兴趣的，感兴趣到什么程度呢？看过一点3B1B；认真（大概）学过离散数学；用函数式语言写过几个玩具，对里头的一些概念有非常浅薄的感性认识。\n\n然后就没了。实际上这上面几个和计算基本不沾边——好吧，不如说跟数学也不沾边——故备考前我的计算能力为**零**。\n\n![[senior-math.jpeg|高中某次周练试卷，选择题都是我认真做的]]\n\n看这张卷子，你觉得我能考120么？我反正不觉得，所以我定的目标是95。\n\n然后当天上午考完就感觉自己稳了。\n### 2.1.2 备考\n我的所有备考规划和执行情况在时间线中已完全展示了，这里就不再赘述，主要推荐几个核心UP。\n\n1. [线代铜](https://space.bilibili.com/1886691242)和[小铜考研数学](https://space.bilibili.com/386786447)（铜哥）\n   第一个账号主做知识性内容，质量很高，但建议尽早跟，否则后期不易跟上思路；对于自认为不擅应试者（比如我），第二个账号的规划和认知相关内容**比知识本身更加重要**！\n   返校后基本按照[130天规划](https://www.bilibili.com/video/BV1yE421w7xH)中「进度慢」一档划分时段。规划中二刷真题套卷的阶段换为了分题型书，具体请看前文时间线图。后期[模拟卷的选择](https://www.bilibili.com/video/BV1BWzwYkEzo)也完全遵照铜哥的推荐顺序。\n   此外，铜哥除B站视频外还在CCtalk上有付费课程（时间线中提到的「重点题」即出自《真题解析》一课），可依个人需求选择性购买。**笔者无利益相关，仅根据个人体会作推荐，请务必试听后再做决定**。\n2. [没咋了](https://space.bilibili.com/452790824)（咋子哥）、[吃尽天下面](https://space.bilibili.com/19742938)（面哥）\n   基础结束后仅余一百天，时间紧张，故依照铜哥指点，未看强化课和讲义，直接跟这二位刷了整本880，**放弃了全部高数证明题**，并通过[讲解](https://www.bilibili.com/video/BV12s421M7cT)补充了一些强化知识。如果没记错的话，我的正确率应该在45%左右……所以最好别对这个指标过于上心，反正先做嘛！至少要让自己准备好去碰一碰真题。\n3. [帕拉迪宇](https://space.bilibili.com/6536560)（牢宇）\n   实际上我并没有看他的各种数学大观，但是[与36讲编写组的对话](https://www.bilibili.com/video/BV15jemeTEai)还是看了的，纠偏作用很显著。没错，我和大家一样，在基础阶段以极低的概率磨完了30讲课后习题和1000题A组（而且还没来得及复盘），然后直接放弃了36讲——现在看来，这个选择太正确了。30讲的基础部分确实已经把考研所需的全部知识点都囊括在内，没有必要为了所谓的「强化阶段」再去听课、看讲义；当然，**做题和复盘**还是需要的。\n\n![[math.png|真题（左）和模拟套卷及选填（右）成绩记录。一片红，漂不漂亮？]]\n\n### 2.1.3 实考\n我在考场上的实际节奏是：\n\n1. 开考约140分钟：做完一遍整卷（证明题除外），蒙错了正确个数<sup>7</sup>，蒙对了同解问题<sup>10</sup>，二重积分<sup>20</sup>数字对、符号错；考前专门加练的极限导数定义<sup>19</sup>想了五分钟还是没思路，「我就知道自己做不来这种题嘛」，放了！\n2. 接下来35分钟：把之前没把握的题目又全部重算了一遍，其中凹凸性<sup>2</sup>、取值范围<sup>3</sup>、定参<sup>11</sup>、斜渐近线<sup>15</sup>和有理函数积分<sup>17</sup>共算了三遍或以上。换限<sup>5</sup>改对了；二重积分<sup>20</sup>经估算发现数字过大，遂重新计算并修改答案。\n3. 最后5分钟：发呆。嗯。考场挺大的，但也挺暖和的。\n\n一般来说大家的共识是「真题/模拟成绩不代表实际成绩」，而我的实践证明了这一观点的正确性——事实上，只要你对应试数学有正确的认知和规划，并依此进行充分的练习，你的最终成绩就**不会低于你的预期成绩**。\n\n> **小插曲**\n> \n> 备考期间听闻我校准备的草稿纸只有A5大小，吓得不轻，遂将手头草稿纸全部对折使用，并限制每次模拟的用量。\n> \n> 结果到考场上他给我发了张报纸。我当时就感觉自己考上了。\n## 2.2 计算机学科专业基础\n### 2.2.1 背景\n作为半瓶水科班，我的基础是：\n\n1. 数据结构：高中OI培训一半遗憾离场，只会暴力，CSP第一次没考到170（因为把矩阵乘法忘了）；\n2. 组成原理：做过学校还算能拿得出手的[课设](https://www.educoder.net/paths/hvbz6g9i)（1—4章），有一次失败的龙芯杯经历；\n3. 操作系统：没做过任何有意义的lab，但是长期用Linux（I use NixOS btw uwu）；\n4. 网络原理：有一个[博客](https://megakite.icu/)，有时候搭搭MC服务器，没怎么接触过物理层和链路层。\n\n其余知识基本上都是在本科课程屎里淘金学出来的，比如在各种大作业里整点活，别人用SpringBoot我用Next.js、别人做了70分我做了90分之类的；但究竟有多大作用其实也不好说。\n### 2.2.2 备考\n仗着上面这些东西，没看课，王道书二轮过完以后直接做真题；结果喜当模拟哥，唯一的红色是考场上考出来的：\n\n![[408.png|真题一刷、二刷分数及用时记录]]\n\n事后回想起来，感觉自己所缺少的仍然主要是硬性知识（e.g. 选择题的计网和大题的硬件除法器）；此外就是关于大题的应试方法（e.g. 计网大题的看图说话+文字游戏）。如果你的战线比我要长，那么某些犄角旮旯的知识点，以及解题技巧等等可能还是需要看一看的：毕竟这就是近些年来的出题风格，i.e. 没活了。\n\n这一科备考期间外部资料看得不多。[Beokayy_](https://space.bilibili.com/16113747)（B姐）的真题解析是免费的，质量尚可，可供参考。\n### 2.2.3 实考\n实考成绩不甚理想的原因当中应该还有心境问题——早上数学考完人直接飘了，下午完全在乱写，结果把老头挖的坑全踩完了；最让人崩溃的还是蒙的选择没有一道对的，请神请到了高中的自己。\n\n算了，不管怎么样，这个分够用了。\n## 2.3 英语（二）\n### 2.3.1 背景\n![[cet.png|四六级成绩，都是只做了一套卷子就上考场了]]\n\n可以说本节的参考价值并不是特别大。事实上，如果你的英语水平与我相当，你只需要知道主观题没必要背模版就可以了（我没背，自己写的，25分）；否则，请**立刻当我在放屁**，并参考其他更有价值的笔记。\n### 2.3.2 备考\n备考初期曾用APP刷过一遍红宝书，统计结果是：在6592词当中，有5500余词可以一次选对释义**并正确拼写**，故我认为词汇量应该仍然是一个比较重要的指标——但还请同时留意一下自己的拼写正确率。我猜测自己相对较高的正确率和我有意确保读音标准有关，毕竟英文是表音文字——虽然对应程度不比法语，但读音很多时候仍然可以作为拼写的预告。\n\n![[english.png|客观题作答记录]]\n\n平日做题无技巧，全靠大力出奇迹。历年真题的初始做题节奏是：\n\n1. ～65分钟按序完成全部客观题**并涂卡**；\n2. ～65分钟按序给三道主观题打草稿；\n3. ～35分钟按序将草稿抄到答题卡上。\n\n时间并不是特别充裕，毕竟大小作文要现场胡诌；而且我的字也不好看，所以抄也得抄慢点。按照上述节奏经过真题套卷训练以后，最快可以在140分钟左右写完一套试卷。\n### 2.3.3 实考\n今年英二的Text 4介绍的是desire path，而我在当天下午前去考场途中，碰巧遇见一条之前从未走过的……desire path。我当时还在想「原来这也有人走啊」——于是考场上通读全文没有任何障碍。\n\n看上去好像是类似命运一般的东西起了作用；但事实上这只是一个非常trivial（平凡）的巧合：因为以我的实力，我就算没走这条路，也可以把题做对。\n\n那么，这个巧合就没有用处么？其实还是有的。它于我而言最大的意义，就是考场上的定心丸——正如数学试卷中的相似合同大题。\n## 2.4 思想政治理论\n与绝大多数工科考生一致，我是在最后半个月才开始认真准备政治的——因为这个时候肖四提纲的PDF出了。11页的篇幅于我而言记忆负担过重（这也是我选择不背英语作文的原因），所以采用**马原全背、其余背前两套**的方式——事实上我的记忆就连马原后两套也很难容纳了，在背诵的过程中就能明显感觉到；不过好在考试一个也没用上。\n\n整个政治备考过程中只关注了一位UP：[帕拉迪宇](https://space.bilibili.com/6536560)（牢宇）。内容做得是真的好，但争议也是真的大，尤其是十二月份那些漫天飞舞的节奏。我在这里不参与阴谋论，也不管他到底是不是五战双非——我只知道我十月份看了他的[前瞻](https://www.bilibili.com/video/BV1ZBxdeyEJf)之后对政治有信心了；看了[六讲](https://pan.quark.cn/s/52e243720a88)之后会做选择题了；考前当天速看了[一页纸](https://www.bilibili.com/video/BV1Kwq6YsE4g)时政部分，然后把第33题做对了；了解了[抄大题](https://www.bilibili.com/video/BV11ykNYiEJc)的方法，靠着每道题**甚至只写了四分之三**的狗爬字在京区拿了25主观分。\n\n所以我没有理由不推荐他。\n## 2.5 总结\n总体上来讲，我的备考过程DIY成分非常大：除了数学以外，没有系统地听过任何视频课程；也因为我对自己的数学水平实在没什么信心，把**70%以上**的时间都分给了它。如今初试成绩已定，这种备考方法对于我个人的有效性已不言而喻了；而如果你与我有相似的背景，那么以上这些经验的参考价值应当也是有保证的。\n\n哦，对了：备考期间闲得无聊敲了[13万字的笔记](https://gitee.com/megakite/denpakei-22408-notes/)，包括数学和408。由于数学事实上是我的弱项，故**有极多错漏，切勿参考**，权当摆设；而408部分可能有一定的价值。至于做笔记这件事本身：各位**千万别学我这么干**！定期复盘的时候简单总结一下就可以了。说实话，有这空拿去二刷错题、看看教材，或者专项突破一下高数证明，你能考400分。\n# 3 复试\n本节的内容就更多是单纯的分享而非经验了，选择性看看就好。\n## 3.1 背景\n先别被下面这一堆东西吓到：这些东西全都是在我大三突然开窍之后才暴发出来的；而且各段经历的深度也有待商榷。换句话说，你可以认为我在进行某种意义上的题海战术。\n### 3.1.1 开源经历\n1. [开源之夏 2023 OI Wiki](https://summer-ospp.ac.cn/2023/org/prodetail/235000254)（JS）；\n2. [谷歌编程之夏 2024 Blender](https://summerofcode.withgoogle.com/archive/2024/projects/eTB9qq4E)（C++）。\n\n这两个项目都是剑走偏锋才申请上的；而且对我来说，除基本的工程能力以外，它们对我最大的帮助其实是让我接触了开源社区和项目的运作流程。此外，二者都是开发类项目，和编译、系统软件和体系结构勉强有一点点关系，但其实也不大。\n\n如果屏幕前的各位有意丰富自己的开源项目经历，也可以试着申请即将进行的[开源之夏2025](https://summer-ospp.ac.cn)活动——事实上，门槛比你想象中要低很多；而[谷歌编程之夏](https://summerofcode.withgoogle.com)也在举办当中，但申请已接近尾声（4月8日截止），欲申从速。\n### 3.1.2 个人项目\n1. [北大编译实践 pku-minic](https://pku-minic.github.io/online-doc/)（C），暂未实现数组；\n2. 根据[学校发的教材](https://m.ryjiaoyu.com/book/details/45227)6.3节写的CPU（SpinalHDL），改为LA32R指令集；\n3. 在上述二者的基础上，给编译器加了LA32R后端，写了个打砖块，上板跑了一下。\n\npku-minic可能需要你从其它地方了解一些前端相关知识（lex/yacc、语义分析）再做，可以选择南大编译（C版本）作为补充。北大这个项目本身给的自由度非常高，做的过程还是挺舒服的，基本上就是尽情施展你的想象力。如果你像我一样用C搓的话，还能把课本上学过的所有数据结构全部手动实现一遍。\n\n至于这个CPU，如果你备考时间充足，我还是更建议你去参加**一生一芯**或者是**龙芯杯**。就我个人的感觉而言，前者能学到的东西更多，而且也更accessible（门槛更低、资料更全面）；而后者则更适合已经有一定体系结构基础的人去挑战——像我这种就不太行。\n\n其实这两个项目差不多做完之后，我才了解到东南大学也有一个非常类似的[课程设计](https://cse.seu.edu.cn/carl/2019/1126/c26591a296968/page.htm)，感觉做得也挺不错的，而且有配套课程，可能门槛会低一些。\n### 3.1.3 毕设\nRocksDB+ZenFS存储系统（C++）。\n\n复试时没怎么做，仅仅只是配了环境。选题本身没什么好说的，本身是热门方向，甚至有专门的[信息页](https://zonedstorage.io/)，学术界和工业界实践都比较丰富；同时因为我有攒机经验、学过数据库，对于存储系统的基本逻辑还是比较了解的，所以在复试的时候其实也能讲一点东西出来。\n### 3.1.4 奖项\n一次三等奖学金。\n\n我自己都忘了是哪一年得的。\n### 3.1.5 竞赛\n1. 省机器人大赛二等奖（Verilog）；\n2. 蓝桥杯省赛二等奖（C++）。\n\n比较没有含金量，至少跟我的前几个项目形成了比较鲜明的对比。对于我来说写在简历上到底算加分项还是减分项都存疑——但是那一栏毕竟不能空着。\n## 3.2 要点\n**不用把复试本身想得太吓人**。这是研究生入学面试，不是企业面试；而且这里是杭高，也不是以所谓「零十开」著称的计算所本部。准备好你的项目，整理一下外在形象，有东西就展示、没东西就承认，做到实事求是、不卑不亢即可。\n\n此外，从拟录取结果上来看，体系方向对于复试的表现相比AI方向（085410）更为看重；而后者有明确的保护高分的现象，这一点在报考时需要加以注意。\n# 4 关于你的未来\n干货差不多讲完了，来讲点**比干货更重要的东西**。\n## 4.1 学长的留言\n![[giao.jpg]]\n\n这段话其实很有意思：它事实上用一种非常易于理解的方式**重释**（reinterpret）了时间，即——你的「现在」与「未来」的关系，并不是你「从现在走向未来」，而是你主动地「[**把未来拉近到现在**](https://zhuanlan.zhihu.com/p/145916051)」。\n\n我认为这是推动自己把某件事情**真正当回事**的一种极为有力的方式。不瞒各位，我在备考期间曾经无数次幻想自己出分时数学竟然考了120的场景——然后我竟然还真的把这个幻想实现了。\n## 4.2 一点辩证法\n![[freedom.png]]\n\n认知正确在先，上面提到的所有备考过程就只是普通的日常。你并不会觉得很累，因为你知道自己**并不是在原地打转，而是一直在主动地「拉近一个被期许的未来」**。\n## 4.3 拒斥失败的可能性\n某天晚上我无意透露项目经历导致报考群内万烟齐发（姑且这么叫吧），遂写一短文以定群友之心。我认为自己所说的这些话对备考过程仍有一定的参考价值，故展示于此。\n\n![[letter.png]]\n\n所以，如果屏幕前的你在备考期间会考虑二战和工作，我一定会表示支持并且给予鼓励，因为这是最稳妥的方案；但如果让我自己考虑的话——我给自己留后路干什么呢？既然我迄今为止的人生中没有任何一件事情是真正用心去做却失败了的，那么我为什么要预设一个**先于自己而存在的、失败的**未来？它对我来说根本就不是未来。\n## 4.4 真正的答案\n事实上，在决定认真备考之前，我对考研这件事情本身都是有些许抗拒的。其一是我以为自己学不会数学（当然这件事情后来似乎被证伪了）；其二则是主要原因：我不想让自己变成所谓的「做题家」——然而我后来发现，我所经历过的一切，都在把我导向这唯一的一种身份。\n\n我有一个相对比较快乐的童年；上了个衡水模式的高中，考出了差强人意的成绩，填报了省内保底211的计科专业；本科就着自己的兴趣学了点东西，但又感觉没学明白，且兴趣方向还有一定门槛，直接就业也没什么底气……\n\n我比较幸运，但又没那么幸运；比较努力，但又没那么努力；我的整个历史——我的「曾在」——似乎都在告诉我「你还剩下一条路可走」。\n\n十几年前我总是不太理解为什么很多人看不到太多的可能性，现在我似乎明白了：当你所选择的「将来」成为你的「曾在」，它们就逐渐将你的可能性收窄；而与此同时，也为你真正地指明了方向。你必须承担这种罪责；而如果你**真的把自己当回事**的话，也必须在罪责的束缚之下，尽全力拉近你这种你**能且只能**期望的将来。\n\n所以，你问我为什么要考研？\n<p align='center'><strong>因为我能且只能成为做题家。</strong></p>\n![[IMG_3201.jpeg]]\n【再见了，所有的统计学院三蹦子】\n\n# A 后记\n备考期间这两张专辑循环了几百遍，基本代表了我这一整年的心境，小推一下。\n![[albums.png]]\n\n分别是Emo和数摇——不过我感觉这两个流派其实未必能分得那么清楚，大家长得都越来越像了。\n\n希望你的录取成绩也可以和我很像。\n\n2025 @megakite\n",
  "metadata": {
    "tags": ["杭高", "一战", "智能", "经验贴", "体系", "CS"],
    "author": "megakite"
  }
}
